In [14]:
import pandas as pd

A = pd.DataFrame({
    "movieCd": ["1001", "1002", "1003"],
    "multiMovieYn": ["Y", "Y", "N"],
    "repNationCd": ["K", "F", None]
})

B = pd.DataFrame({
    "movieCd": ["1001", "1003", "1004"],
    "multiMovieYn": [None, "Y", "Y"],
    "repNationCd": [None, "F", "K"]
})

Combine_first()는 index를 기준으로 병합한다.
1. `movieCd`를 인덱스로 하여, movieCd를 기준으로 병합이 되게 설정한다.
2. combine_first()를 통해 A와 B를 movieCd를 기준으로 병합한다.
3. movieCd의 값이 1003인 경우, repNationCd가 None이므로, B의 F값을 가져온다.
4. movieCd의 값이 1004인 경우, A에는 존재하지 않기 때문에 B에서 ultiMovieYn과 repNationCd으

In [15]:
A = A.set_index("movieCd")
A

        multiMovieYn repNationCd
movieCd
1001               Y           K
1002               Y           F
1003               N        None

In [16]:
B = B.set_index("movieCd")
B

        multiMovieYn repNationCd
movieCd
1001            None        None
1003               Y           F
1004               Y           K

In [17]:
A.combine_first(B).reset_index()

  movieCd multiMovieYn repNationCd
0    1001            Y           K
1    1002            Y           F
2    1003            N           F
3    1004            Y           K